In [1]:
import pandas as pd

2 main Datatypes

In [2]:
Series = pd.Series(["Apple", " Mango", "Banana"])  # Series is one dimentional

In [3]:
Series

0     Apple
1     Mango
2    Banana
dtype: object

In [4]:
Colours= pd.Series(["Black","Blue","Orange"])

In [5]:
Colours

0     Black
1      Blue
2    Orange
dtype: object

In [6]:
#Dataframe = 2 dimentional (written in dictionary format)

In [7]:
Dataframe=pd.DataFrame({"Fruits":Series,"Colours":Colours})
Dataframe

   Fruits Colours
0   Apple   Black
1   Mango    Blue
2  Banana  Orange

In [8]:
#Import Dataset

In [9]:
car_sales=pd.read_csv("car-sales.csv")

In [10]:
car_sales           #row =(axis=0)   column=(axis=1)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
#Exporting the dataframe
car_sales.to_csv("exported_car_sales.csv", index= False)

In [12]:
exported_car_sales= pd.read_csv("exported_car_sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

![](pandas-anatomy-....png)

![](pandas-anatomy-....png)

![](pandas-anatomy-of-a-dataframe)

![](pandas-anatomy-of-a-dataframe.png)

## Describe Data

In [13]:
#Attribute (do not have brackets)
car_sales.dtypes

#Function (contain brackets)
#car_sales.to_csv

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [14]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
car_columns=car_sales

In [16]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)